{"type":"data","nodes":[null,{"type":"data","data":[{"meta":1,"content":4},{"title":2,"date":3},"Rebuilding This Website in Svelte","2025-05-30","\u003Cp>In 2022, just over three years ago, I started my FloppySite project with the intention of displaying all of the stupid projects I have worked on up to that point. Three years feels like far too little time for how much I have done since then. I wasn&#39;t even halfway through college at that point, yet since then, I have amassed 5 times as many projects from where I started. Realistically, I don’t even know where I found the time to do all of those. \u003C/p>\n\u003Cp>As of the writing of this article, I just graduated college and am about to start working. When I wrote the version of this site in React almost two and a half years ago as an update, I was doing it with the intention of looking for jobs, and I always said I would rewrite everything to be better when I graduated. ‘Better’ was always subjective, but in my head, it was more cohesive, consistent, cleaner. So of course, in the slight break afforded to me, I did just that. \u003C/p>\n\u003Cp>This version of the FloppySite, no longer bound by the slow speeds of floppy disks or poor site optimization, is really what I was hoping to make when I made the very first commit years ago. This is what I wanted when I thought of a portfolio. The next website I make will not be a portfolio. It will be something for fun or for a purpose other than showing off the other things I have done. I am really proud of all of the things I have learned in the process of building these websites, but I am not a web developer, and I think it is time for me to go back to my specialty and make something physical.\u003C/p>\n\u003Cp>Thank you to all of you who have visited over the years – I see you on the Cloudflare dashboard.\u003C/p>\n\u003Cp>Here are the older versions of this site so you can see how things have changed:\u003C/p>\n\u003Cp>V2: \u003Ca href=\"https://brianchill.us/v2/index.html\">brianchill.us/v2/index.html\u003C/a>\u003C/p>\n\u003Cp>V1: \u003Ca href=\"https://brianchill.us/v2/old/index.html\">brianchill.us/v2/old/index.html\u003C/a>\u003C/p>\n\u003Cp>And as always, until next time.\u003C/p>\n"],"uses":{"params":["slug"]}}]}
