{"type":"data","nodes":[null,{"type":"data","data":[{"meta":1,"content":4},{"title":2,"date":3},"Making a really tiny keyboard","2024-12-22","\u003Cp>I have made a lot of QMK based keyboard projects in the past. I like microcontrollers, and I like keyboards, so fusing them together seems pretty ideal for short term projects that I do (that’s a lie, most of my projects take forever). However, sometimes when I want to make something weird, in a smililar fashion to what I currently make but more creatively driven, I think the things I make really shine. The \u003Ca href=\"https://github.com/TrojanPinata/Model-B\">Model-B\u003C/a> is still my proudest project to date, but I would like to introduce the \u003Ca href=\"https://github.com/TrojanPinata/tiny-keeb\">tiny keeb.\u003C/a>\u003C/p>\n\u003Cimg src=\"https://i.imgur.com/Imawi3y.jpeg\" alt=\"tiny keeb\" />\n\n\u003Cp>The tiny keeb is a 60% keyboard which has a footprint one quarter the area of a traditional 60% board. Since this keyboard is so small, it can’t use traditional keyboard switches or keycaps. I had to develop my own keycaps in conjunction with some Omron industrial switches in order to reduce the size and increase usability. It’s also small enough that my Prusa mini could print everything on its tiny 180mm x 180mm plate.\u003C/p>\n\u003Cp>This keyboard does work, and it is powered by the same \u003Ca href=\"https://github.com/TrojanPinata/Pico\">Raspberry Pi Pico clone I made in the past\u003C/a>. The usability is kind of rough, as it is so small, but everyone who has used it has developed new weird ways to type on it – ranging from using thumbs to forcing touch-typing style.\u003C/p>\n\u003Cimg src=\"https://i.imgur.com/lIwTasf.jpeg\" alt=\"model-b reference\" />\n\n\u003Cp>The one thing I feel does not come across on camera is just how small the whole thing is. It is smaller than my phone, and each keycap is smaller than my fingernail. It is so small that I gave up sanding the keycaps because I was having trouble securing them to anything while I sanded. That’s not even to mention I could not put labels on them because the stickers had trouble sticking from both the size and material.\u003C/p>\n\u003Cp>This project was a lot of fun. It was really difficult to consolidate the entire thing into such a small package. Hopefully its size comes across on camera.\u003C/p>\n\u003Cimg src=\"https://i.imgur.com/WvSqKAf.jpeg\" alt=\"one of my favorite pcbs\" />\n\n\u003Cp>Until next time.\u003C/p>\n"],"uses":{"params":["slug"]}}]}
