{"type":"data","nodes":[null,{"type":"data","data":[{"meta":1,"content":4},{"title":2,"date":3},"Making Another Keyboard to Satisfy My Addiction","2024-11-22","\u003Cp>Over two years ago (\u003Ca href=\"https://brianchill.us/v2/old/index.html\">when this site looked like this\u003C/a>), I made a keyboard called the \u003Ca href=\"https://github.com/TrojanPinata/Model-K-Pico\">Model K Pico\u003C/a>. It utilized a Raspberry Pi Pico, a somewhat new microcontroller at the time, to integrate a bunch of features I thought would be cool. It had an OLED display, volume knob, and all through hole components so that nearly anyone could build it. However, as it was my first keyboard, it did have a lot of flaws. Most importantly, the switchplate was made of acrylic and cracked during construction, the design was somewhat fragile feeling, and the board \u003Ci>felt\u003C/i> like I had made it from scratch. But it chugged on for years. I never had a single issue with it after it’s construction. I did make some changes to the firmware for fun, but overall, it was extremely solid. I am really proud of the Model K.\u003C/p>\n\u003Cimg src=\"https://i.imgur.com/oxs17nZ.jpeg\" alt=\"model k\" />\n\n\u003Cp>But like everything, I now know a lot more about design and engineering. I am near the end of my education in computer engineering and I still love keyboards. And most importantly, I want to give the things I make to other people – even if they just put them on a shelf forever. So, I decided to make another keyboard. This one was called the \u003Ca href=\"https://github.com/TrojanPinata/Model-A\">Model A\u003C/a>, and it failed within one iteration of my design process. I looked at the price to produce and pulled the plug immediately. That was a while ago, and I really never thought I was going to make another keyboard. The cost was way too high for a single keyboard. So, I shelved the project for a while. \u003C/p>\n\u003Cp>Or it would have been a while if I had not had people in my life who were also interested in keyboards. Talking with them made me want to design something that I could also give to them. And as such, in April 2024 I started making the \u003Ca href=\"https://github.com/TrojanPinata/Model-B\">Model B\u003C/a>. As it is currently November 2024 when I am writing this, I think you can see that this took a while. I wanted to design all of the features of the previous board, streamline the layout a bit, and still keep that traditional \u003Ci>Brian\u003C/i> flair that comes with the things I make.\u003C/p>\n\u003Cimg src=\"https://i.imgur.com/7yxFbYw.jpeg\" alt=\"full shot\" />\n\n\u003Cp>The board has the same OLED display, volume knob, and 75% layout, but also includes a special button for switching screens, a full acrylic case with Delrin switchplate, and integrated stand at ~7 degree angle. It also has a window specifically for looking at the microcontroller and components laid out on the board. I chose to use SMD components for a much more professional look, and I added hotswappable sockets to allow whoever gets this board to customize it to their liking. I felt like this would make the project something more of a collaboration and help people enjoy the thing I made them for longer. Oh, and as a cherry on top, it still uses the same Raspberry Pi Pico processor I used on the first one.\u003C/p>\n\u003Cimg src=\"https://i.imgur.com/10xAQjR.jpeg\" alt=\"close up\" />\n\n\u003Cp>The keyboard is finished and gifted to those I have wanted to deliver them to, so I feel like I can write this now. But I am really proud of this project. It has a certain feeling to it that I cannot describe, and I really hope those who get it are as happy with it as I am. There are a couple of quirks, but I really only had one shot with designing and manufacturing this so I am happy.\u003C/p>\n\u003Cimg src=\"https://i.imgur.com/dlf4HPK.jpeg\" alt=\"a pretty nice photo\" />\n\n\u003Cp>I may do this again in the future, but if I do that then I am getting a bunch manufactured and I am selling some. The \u003Ca href=\"https://github.com/TrojanPinata/Model-B\">Github for the project is here\u003C/a>. I may make a video about this – but probably not. \u003C/p>\n\u003Cp>Regardless and as always,\u003C/p>\n\u003Cp>Until next time.\u003C/p>\n"],"uses":{"params":["slug"]}}]}
