{"type":"data","nodes":[null,{"type":"data","data":[{"meta":1,"content":4},{"title":2,"date":3},"Homelab","2022-08-11","\u003Cp>I orignally intended for this page to be about my &#39;homelab&#39; that I had built and running, but I guess this is going to be more of a short memorial to what was.\u003C/p>\n\u003Cp>At the start of covid, I was bored, so I started working in other operating systems then Windows. I had been working with Ubuntu since I was 14 on a old Compaq with less cores then I have wheels on my car. Safe to say, I was not good at running Linux. But I wanted to be, and I discovered  \u003Ca href=\"https://reddit.com/r/homelab\">r/homelab\u003C/a> on reddit. And I thought, wow that&#39;s cool I want to do that. So early covid, when I had a ton of time, I went on Facebook marketplace and bought a 50 lbs server (HP Proliant G6 2U) with dual Intel Xeons, 64 GB of DDR3 RAM, 8 bays for hard drives, and two \u003Cb>hulking\u003C/b> 450-watt power supplies. I probably should not own this server. Enterprise grade hardware is expensive, and resource intensive, and I love it, but is extremely powerful can run away from you without a enterprise grade budget. It is a HP ProLiant from ~2012 with the caveat that it can only run HP supported drives. Which is super restraining. If you do run a drive that is not HP approved, it will run the fans as fast and loud as it can, and everyone in your house will be able to hear it. How do I know this, because I did it. And my power bill went up $300 dollars. I also had to mod a battery into it to make the hdd port map (at least I think that’s what it&#39;s called) be non-volatile and not reset after every boot. Now, as you can tell, I was not very responsible with this. So, I don&#39;t run it anymore. However, I can definitely say that it was a learning experience as I now understand Proxmox and ESXi way better. In the short time I had run it, I ran two NAS servers, a website, a Ubuntu playground which I specifically used to run old versions of windows and nuke with viruses, and my first taste of the addictive poison that is Arch Linux.\u003C/p>\n\u003Cimg src=\"https://i.imgur.com/ahWrquN.jpg\" alt=\"picture of the lad\" />\n\n\u003Cp>(on blocks because racks are expensive and wood to make one was even more expensive at the time)\u003C/p>\n\u003Cp>So now, about a year and some after I shut it down for the hopefully not last time, I have two dedicated NAS (network attached storage if that wasn&#39;t clear) servers which I use constantly, and a Raspberry Pi 3 running OctoPrint for my 3D printer. That&#39;s it. I save so much on power now, it&#39;s not even funny. I sacrificed my playgrounds for actual computers running Arch/Windows/Ubuntu/BSD with VirtualBox and it is so much better than it was. I typically run all of my computationally heavy stuff on my primary computer (I&#39;ll write a page about my PC at a future date, it&#39;s a lot) but otherwise I use old laptops, and old Inspiron with a i7 and runs smoother and more reliably then any of my other computers, and sometimes, if I need the GPU, an old Alienware X51 which I sometimes leave running for weeks processing video on its GT600 and lowish spec power supply. As you can tell, things are different and better. I now primary Arch Linux as my secondary OS and I can&#39;t really use a bare metal hypervisor like I&#39;m used to, so I just pretend I never touched enterprise grade hardware and use my laptop like a good, non-power user for my classes.\u003C/p>\n\u003Cp>I don&#39;t plan on waking this monster up for a little while. So for now, sleep well sweet prince.\u003C/p>\n\u003Ch3>August 11th, 2022\u003C/h3>\n\u003Cp>This is a update to the above post. I didn&#39;t want to make a whole new page to feature this so I&#39;m just going to append this.\u003C/p>\n\u003Cp>It is currently August 2022, and I have some good and bad news. To start with the bad, I still have not woken up the Proliant (and will not for the forseeable future). Sad, I know. But in much better news, I have finally found time to make a proper server using Proxmox. I like it much better then ESXi because I find it much more familiar for some reason. I&#39;m using a old gaming PC I was given (old like 2012) and overall, it works pretty well. 16GB RAM on a Intel i7 3770 with a GTX 660 (which cannot be passed though RIP) and I&#39;m pretty happy with its performance. I run Ubuntu server with docker and a dozen or so containers along with a few other VMs when I need them, and it works for me. In the future, I&#39;d like to build a dedicated server using a Xeon E3-1245 and actual server grade components, but I am concerned about power now and a few hundred dollars added to my total at the end of the month does not sound appetizing. I want to upgrade my NAS eventually too to unRAID, but that is even further in the future. Synology is plug and play, so I&#39;m just going to keep rocking this for now. My power draw averages ~45 Watts or a little over 1 kWh which I think is pretty good for the 330 Watt power supply. The GPU thing does annoy me, but it doesn&#39;t suck power so w/e i guess. I&#39;ve been using this whole system to replace a tertiary computer I used for a few years which has a gen 1 i7 in it and strains when I need to switch operating systems. The poor thing would get rebooted 30+ times a week and I didn&#39;t feel like I could rely on it.\u003C/p>\n\u003Cp>Other than that, I think that’s all for this update. I will try and update again in the future because this is something I sincerely enjoy. I learned that most of the RAM in the Proliant is actually 4GB Registered ECC and there are like 16 sticks, so that will cut down on some of my operating costs if I build a server. I joke that when I get a &quot;big boy job&quot; the first thing I&#39;ll do is build one. But that’s a ways away. \u003C/p>\n\u003Cp>Anyway, that&#39;s just an update. I will update this page more frequently in the future. Until I don&#39;t.\u003C/p>\n\u003Cp>Until next time.\u003C/p>\n"],"uses":{"params":["slug"]}}]}
